src/Documents/ИнвентаризацияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИнвентаризацияЗапасов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборИнвентаризации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВБазовыхЕИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикиИспользуются</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ДополнительнаяКолонкаПечатныхФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДополнительнаяКолонкаПечатныхФормДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыводить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыОтветственныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОтветственныхЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кладовщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИнвентаризацияЗапасов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область СлужебныеПроцедурыИФункции
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ
	
	// Процедура формирует и выводит печатную форму документа по указанному макету.
	//
	// Параметры:
	//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
	//				   форма.
	//  ИмяМакета    - Строка, имя макета печатной формы.
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// ДОКУМЕНТ ИНВЕНТАРИЗАЦИЯ
			Если ИмяМакета = "ИнвентаризацияЗапасов" Тогда
				
				ВалютаПечати = "Рубль" ;
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
				Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
				              |	ИнвентаризацияЗапасов.Номер КАК Номер,
				              |	ИнвентаризацияЗапасов.Дата КАК ДатаДокумента,
				              |	ИнвентаризацияЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				              |	ИнвентаризацияЗапасов.Склад КАК Склад,
				              |	ИнвентаризацияЗапасов.Запасы.(
				              |		НомерСтроки КАК НомерСтроки,
				              |		Номенклатура КАК Номенклатура,
				              |		ВЫБОР
				              |			КОГДА (ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
				              |				ТОГДА ИнвентаризацияЗапасов.Запасы.Номенклатура.Наименование
				              |			ИНАЧЕ ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
				              |		КОНЕЦ КАК Товар,
				              |		Количество КАК Количество,
				              |		ИнвентаризацияЗапасов.Запасы.Количество - ИнвентаризацияЗапасов.Запасы.Отклонение КАК КоличествоПоУчету,
				              |		Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
				              |		Цена КАК Цена,
				              |		Сумма КАК Сумма,
				              |		СуммаУчет КАК СуммаПоУчету,
				              |		Отклонение КАК Отклонение,
				              |		Номенклатура.Код КАК Код,
				              |		Номенклатура.Артикул КАК Артикул,
				              |		Партия КАК Партия
				              |	) КАК Запасы,
				              |	ИнвентаризацияЗапасов.ВидОперации КАК ВидОперации
				              |ИЗ
				              |	Документ.ИнвентаризацияЗапасов КАК ИнвентаризацияЗапасов
				              |ГДЕ
				              |	ИнвентаризацияЗапасов.Ссылка = &ТекущийДокумент
				              |
				              |УПОРЯДОЧИТЬ ПО
				              |	ИнвентаризацияЗапасов.Запасы.НомерСтроки";
				Шапка = Запрос.Выполнить().Выбрать();
				
				Шапка.Следующий();
				ВыборкаСтрокТовары = Шапка.Запасы.Выбрать();
				
				ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияЗапасов_ИнвентаризацияЗапасов";
				
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияЗапасов.ИнвентаризацияЗапасов");
				
				НомерДокумента = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
				
				ДопКолонка = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ДополнительнаяКолонкаПечатныхФормДокументов");
				Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
					ВыводитьКоды = Истина;
					Колонка = "Артикул";
				ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
					ВыводитьКоды = Истина;
					Колонка = "Код";
				Иначе
					ВыводитьКоды = Ложь;
				КонецЕсли;
				
				// Выводим шапку накладной
				ОбластьНомера = Макет.ПолучитьОбласть("Заголовок|НомерСтроки");
				ОбластьКодов  = Макет.ПолучитьОбласть("Заголовок|КолонкаКодов");
				ОбластьДанных  = Макет.ПолучитьОбласть("Заголовок|Данные");
				
				ОбластьНомера.Параметры.ТекстЗаголовка ="Инвентаризация запасов № "
				+ НомерДокумента
				+ " от "
				+ Формат(Шапка.ДатаДокумента, "ДФ=""dd MMMM yyyy""");
				ТабличныйДокумент.Вывести(ОбластьНомера);
				Если ВыводитьКоды Тогда
					ТабличныйДокумент.Присоединить(ОбластьКодов);
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьДанных);
				
				// Выводим данные об организации и складе
				ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				СведенияОбОрганизации    = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.СтруктурнаяЕдиница.Организация, Шапка.ДатаДокумента);
				ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
				ОбластьМакета.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
				Если Шапка.ВидОперации=Перечисления.ВидыОпераций.ПоСкладу Тогда
					ОбластьМакета.Параметры.НаименованиеОснования= "Склад:";
				Иначе
					ОбластьМакета.Параметры.НаименованиеОснования= "Сотрудник:";
				КонецЕсли;		
				
				ОбластьМакета.Параметры.ОтчетПо= Шапка.Склад;
				
				ОбластьМакета.Параметры.ВалютаНаименование = Строка(ВалютаПечати);
				ОбластьМакета.Параметры.Валюта             = ВалютаПечати;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Выводим шапку таблицы
				ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
				ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
				ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
				
				ТабличныйДокумент.Вывести(ОбластьНомера);
				Если ВыводитьКоды Тогда
					ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
					ТабличныйДокумент.Присоединить(ОбластьКодов);
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьДанных);
				
				ИтогСуммы        = 0;
				ИтогСуммыПоУчету = 0;
				
				ОбластьНомера = Макет.ПолучитьОбласть("Строка1|НомерСтроки");
				ОбластьКодов  = Макет.ПолучитьОбласть("Строка1|КолонкаКодов");
				ОбластьДанных  = Макет.ПолучитьОбласть("Строка1|Данные");
				
				Пока ВыборкаСтрокТовары.Следующий() Цикл
					
					ОбластьНомера.Параметры.НомерСтроки = ВыборкаСтрокТовары.НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьНомера);
					Если ВыводитьКоды Тогда
						Если Колонка = "Артикул" Тогда
							ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
						Иначе
							ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Код;
						КонецЕсли;
						ТабличныйДокумент.Присоединить(ОбластьКодов);
					КонецЕсли;
					ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
					ТабличныйДокумент.Присоединить(ОбластьДанных);
					ИтогСуммы        = ИтогСуммы        + ВыборкаСтрокТовары.Сумма;
					ИтогСуммыПоУчету = ИтогСуммыПоУчету + ВыборкаСтрокТовары.СуммаПоУчету;
					
				КонецЦикла;
				
				// Вывести Итого
				ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
				ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
				ОбластьДанных  = Макет.ПолучитьОбласть("Итого|Данные");
				
				ТабличныйДокумент.Вывести(ОбластьНомера);
				Если ВыводитьКоды Тогда
					ТабличныйДокумент.Присоединить(ОбластьКодов);
				КонецЕсли;
				ОбластьДанных.Параметры.Всего 			= ФормированиеПечатныхФорм.ФорматСумм(ИтогСуммы);
				ОбластьДанных.Параметры.ВсегоПоУчету 	= ФормированиеПечатныхФорм.ФорматСумм(ИтогСуммыПоУчету);
				ТабличныйДокумент.Присоединить(ОбластьДанных);
				
				// Выводим подписи к документу
				ОбластьНомера = Макет.ПолучитьОбласть("Подписи|НомерСтроки");
				ОбластьКодов  = Макет.ПолучитьОбласть("Подписи|КолонкаКодов");
				ОбластьДанных  = Макет.ПолучитьОбласть("Подписи|Данные");
				
				ТабличныйДокумент.Вывести(ОбластьНомера);
				Если ВыводитьКоды Тогда
					ТабличныйДокумент.Присоединить(ОбластьКодов);
				КонецЕсли;
				Кладовщик=ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Шапка.СтруктурнаяЕдиница.Организация,Перечисления.ТипыОтветственныхЛиц.Кладовщик,Шапка.ДатаДокумента);
				Если Кладовщик.Количество()>0 Тогда 
					ОбластьДанных.Параметры.ОтпустилПредставление=ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Кладовщик[0].Сотрудник));
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьДанных);
				
			КонецЕсли;
			
			// ФОРМА ИНВ3	
			Если ИмяМакета = "ПФ_ИНВ3" ИЛИ ИмяМакета = "ИНВ3БезФактическихДанных" Тогда
				
				// ВалютаПечати = Справочники.Валюты.на;
				
				Запрос       = Новый Запрос;
				Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
				Запрос.УстановитьПараметр("Дата", ТекущийДокумент.Дата);
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ИнвентаризацияЗапасов.Номер КАК Номер,
				|	ИнвентаризацияЗапасов.Дата КАК ДатаДокумента,
				|	ИнвентаризацияЗапасов.Дата КАК ДатаНачалаИнвентаризации,
				|	ИнвентаризацияЗапасов.Дата КАК ДатаОкончанияИнвентаризации,
				|	ИнвентаризацияЗапасов.СтруктурнаяЕдиница.Организация КАК Организация,
				|	ИнвентаризацияЗапасов.СтруктурнаяЕдиница.Представление КАК Подразделение,
				|	ИнвентаризацияЗапасов.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
				|	ИнвентаризацияЗапасов.Запасы.(
				|		НомерСтроки КАК Номер,
				|		Номенклатура,
				|		ВЫБОР
				|			КОГДА (ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
				|				ТОГДА ИнвентаризацияЗапасов.Запасы.Номенклатура.Наименование
				|			ИНАЧЕ ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
				|		КОНЕЦ КАК ТоварНаименование,
				|		Партия,
				|		Номенклатура.Код КАК ТоварКод,
				|		ВЫБОР
				|			КОГДА ИнвентаризацияЗапасов.Запасы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|				ТОГДА ИнвентаризацияЗапасов.Запасы.Номенклатура.ЕдиницаИзмерения.Наименование
				|			ИНАЧЕ ВЫБОР
				|					КОГДА ИнвентаризацияЗапасов.Запасы.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|						ТОГДА ИнвентаризацияЗапасов.Запасы.Номенклатура.УпаковкаДляОтчета.Наименование
				|				КОНЕЦ
				|		КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
				|		Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
				|		Цена КАК Цена,
				|		ВЫБОР
				|			КОГДА ИнвентаризацияЗапасов.Запасы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|				ТОГДА ИнвентаризацияЗапасов.Запасы.Количество
				|			ИНАЧЕ ВЫБОР
				|					КОГДА ИнвентаризацияЗапасов.Запасы.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|						ТОГДА ИнвентаризацияЗапасов.Запасы.Количество / ИнвентаризацияЗапасов.Запасы.Номенклатура.УпаковкаДляОтчета.Коэффициент
				|				КОНЕЦ
				|		КОНЕЦ КАК ФактКоличество,
				|		КоличествоПоДаннымУчета КАК БухКоличество,
				|		Сумма КАК ФактСумма,
				|		СуммаУчет КАК БухСумма,
				|		Партия КАК Партия
				|	)
				|ИЗ
				|	Документ.ИнвентаризацияЗапасов КАК ИнвентаризацияЗапасов
				|ГДЕ
				|	ИнвентаризацияЗапасов.Ссылка = &ТекущийДокумент
				|
				|УПОРЯДОЧИТЬ ПО
				|	ИнвентаризацияЗапасов.Запасы.НомерСтроки";
				Шапка = Запрос.Выполнить().Выбрать();
				
				Шапка.Следующий();
				
				ВыборкаСтрокТовары = Шапка.Запасы.Выбрать();
				
				// Зададим параметры макета по умолчанию
				ТабличныйДокумент.ПолеСверху              = 10;
				ТабличныйДокумент.ПолеСлева               = 0;
				ТабличныйДокумент.ПолеСнизу               = 0;
				ТабличныйДокумент.ПолеСправа              = 0;
				ТабличныйДокумент.РазмерКолонтитулаСверху = 10;
				ТабличныйДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
				
				ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияЗапасов_ИНВ3";
				Макет       = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияЗапасов.ПФ_ИНВ3");
				
				//////////////////////////////////////////////////////////////////////
				// 1-я страница формы
				
				// Выводим шапку накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
				ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
				ОбластьМакета.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
				
				Если Шапка.ДатаДокумента < Дата('20110101') Тогда
					НомерДокумента = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
				Иначе
					НомерДокумента =ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс, Истина);
				КонецЕсли;		
				
				ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
				ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
				ОбластьМакета.Параметры.НомерДокумента           = НомерДокумента;
				ОбластьМакета.Параметры.ДатаОкончанияИнвентаризацииЛокальныйФормат = Шапка.ДатаОкончанияИнвентаризации; 
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				//////////////////////////////////////////////////////////////////////
				// 2-я страница формы
				
				ИтогФактКоличество = 0;
				ИтогФактСумма      = 0;
				ИтогФактСуммаВсего = 0;
				ИтогБухКоличество  = 0;
				ИтогБухСумма       = 0;
				
				КолвоСтрокПоСтранице = 0;
				КолвоПоСтранице      = 0;
				СуммаЛиста           = 0;
				ИтогоКолво           = 0;
				
				НомерСтраницы = 2;
				Ном = 0;
				
				// Выводим заголовок таблицы
				ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
				ЗаголовокТаблицы.параметры.црк1 ="Цена"+ Символы.ПС+ ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты() + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодДробнойчастВалюты();
				ЗаголовокТаблицы.параметры.срк1 ="Сумма"+ Символы.ПС+ ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты() + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодДробнойчастВалюты();
				ЗаголовокТаблицы.параметры.срк2 ="Сумма"+ Символы.ПС+ ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты() + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодДробнойчастВалюты();
				ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
				
				// Выводим многострочную часть документа
				ПодвалСтраницы  = Макет.ПолучитьОбласть("ПодвалСтраницы");	
				
				Пока ВыборкаСтрокТовары.Следующий() Цикл
					
					Ном = Ном + 1;
					СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка1");
					
					СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары);
					СтрокаТаблицы.Параметры.ТоварНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокТовары.ТоварНаименование, 
					ВыборкаСтрокТовары.Партия);
					
					Если ИмяМакета = "ИНВ3БезФактическихДанных" Тогда
						СтрокаТаблицы.Параметры.ФактКоличество = "";
						СтрокаТаблицы.Параметры.ФактСумма = "";	
					КонецЕсли;
					
					СтрокаСПодвалом = Новый Массив;
					СтрокаСПодвалом.Добавить(СтрокаТаблицы);
					СтрокаСПодвалом.Добавить(ПодвалСтраницы);
					
					Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
						
						ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
						
						Если ИмяМакета = "ПФ_ИНВ3" Тогда
							ОбластьИтоговПоСтранице.Параметры.ИтогоФактКоличество = ИтогФактКоличество;
							ОбластьИтоговПоСтранице.Параметры.ИтогоФактСумма      = ИтогФактСумма;	
						КонецЕсли;
						ОбластьИтоговПоСтранице.Параметры.ИтогоБухКоличество  = ИтогБухКоличество;
						ОбластьИтоговПоСтранице.Параметры.ИтогоБухСумма       = ИтогБухСумма;
						
						ОбластьИтоговПоСтранице.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
						Если ИмяМакета = "ПФ_ИНВ3" Тогда
							ОбластьИтоговПоСтранице.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ФормированиеПечатныхФорм.КоличествоПрописью(КолвоПоСтранице);
							ОбластьИтоговПоСтранице.Параметры.СуммаФактическиНаСтраницеПрописью                 = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СуммаЛиста);	
						КонецЕсли;
						
						ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
						
						НомерСтраницы = НомерСтраницы + 1;
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						
						ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
						ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
						
						ИтогФактКоличество = 0;
						ИтогФактСумма      = 0;
						ИтогБухКоличество  = 0;
						ИтогБухСумма       = 0;
						
						КолвоСтрокПоСтранице = 0;
						КолвоПоСтранице      = 0;
						СуммаЛиста           = 0;
						
					КонецЕсли;
					
					СтрокаТаблицы.Параметры.Номер = Ном;
					СтрокаТаблицы.Параметры.ТоварНаименование = ВыборкаСтрокТовары.ТоварНаименование;
					
					ТабличныйДокумент.Вывести(СтрокаТаблицы);
					
					Если ИмяМакета = "ПФ_ИНВ3" Тогда
						ИтогФактКоличество = ИтогФактКоличество + ВыборкаСтрокТовары.ФактКоличество;
						ИтогФактСумма      = ИтогФактСумма      + ВыборкаСтрокТовары.ФактСумма;
						ИтогФактСуммаВсего = ИтогФактСуммаВсего + ВыборкаСтрокТовары.ФактСумма;
					КонецЕсли;
					ИтогБухКоличество  = ИтогБухКоличество  + ВыборкаСтрокТовары.БухКоличество;
					ИтогБухСумма       = ИтогБухСумма       + ВыборкаСтрокТовары.БухСумма;
					ИтогоКолво         = ИтогоКолво         + ВыборкаСтрокТовары.ФактКоличество;
					
					КолвоСтрокПоСтранице = КолвоСтрокПоСтранице + 1;
					КолвоПоСтранице      = КолвоПоСтранице      + ВыборкаСтрокТовары.ФактКоличество;
					СуммаЛиста           = СуммаЛиста           + ВыборкаСтрокТовары.ФактСумма;
					
				КонецЦикла;
				
				// Выводим итоги по последней странице
				ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
				
				Если ИмяМакета = "ПФ_ИНВ3" Тогда
					ОбластьИтоговПоСтранице.Параметры.ИтогоФактКоличество  = ИтогФактКоличество;
					ОбластьИтоговПоСтранице.Параметры.ИтогоФактСумма       = ИтогФактСумма;
					ОбластьИтоговПоСтранице.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ФормированиеПечатныхФорм.КоличествоПрописью(КолвоПоСтранице);
					ОбластьИтоговПоСтранице.Параметры.СуммаФактическиНаСтраницеПрописью                 = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СуммаЛиста);
				КонецЕсли;
				ОбластьИтоговПоСтранице.Параметры.ИтогоБухКоличество   = ИтогБухКоличество;
				ОбластьИтоговПоСтранице.Параметры.ИтогоБухСумма        = ИтогБухСумма;
				ОбластьИтоговПоСтранице.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
				ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				// Выводим подвал документа
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				Если ИмяМакета = "ПФ_ИНВ3" Тогда
					ОбластьМакета.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ФормированиеПечатныхФорм.КоличествоПрописью(ИтогоКолво);
					ОбластьМакета.Параметры.СуммаФактическиНаСтраницеПрописью                 = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(ИтогФактСуммаВсего);
				КонецЕсли;
				ОбластьМакета.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(ВыборкаСтрокТовары.Количество(), ,",,,,,,,,0");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛ");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				ОбластьМакета.Параметры.НачальныйНомерПоПорядку = 1;
				ОбластьМакета.Параметры.НомерКонца              = ВыборкаСтрокТовары.Количество();
				
				ОбластьМакета.Параметры.ДатаДокумента 	= Шапка.ДатаДокумента;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;
			
			// ФОРМА ИНВ19	
			Если ИмяМакета = "ПФ_ИНВ19" Тогда
				
				// ВалютаПечати = Константы.НациональнаяВалюта.Получить();
				
				Запрос       = Новый Запрос;
				Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
				Запрос.УстановитьПараметр("Дата", ТекущийДокумент.Дата);
				Запрос.Текст =
				"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
				|	ИнвентаризацияЗапасов.Номер КАК Номер,
				|	ИнвентаризацияЗапасов.Дата КАК ДатаДокумента,
				|	ИнвентаризацияЗапасов.Дата КАК ДатаНачалаИнвентаризации,
				|	ИнвентаризацияЗапасов.Дата КАК ДатаОкончанияИнвентаризации,
				|	ИнвентаризацияЗапасов.СтруктурнаяЕдиница.Организация КАК Организация,
				|	ИнвентаризацияЗапасов.СтруктурнаяЕдиница.Представление КАК ПредставлениеПодразделения,
				|	ИнвентаризацияЗапасов.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
				|	ИнвентаризацияЗапасов.Запасы.(
				|		НомерСтроки КАК Номер,
				|		Номенклатура,
				|		ВЫБОР
				|			КОГДА (ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
				|				ТОГДА ИнвентаризацияЗапасов.Запасы.Номенклатура.Наименование
				|			ИНАЧЕ ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
				|		КОНЕЦ КАК ТоварНаименование,
				|		Партия,
				|		Номенклатура.Артикул КАК Артикул,
				|		Номенклатура.Код КАК ТоварКод,
				|		ВЫБОР
				|			КОГДА ИнвентаризацияЗапасов.Запасы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|				ТОГДА ИнвентаризацияЗапасов.Запасы.Номенклатура.ЕдиницаИзмерения.Наименование
				|			ИНАЧЕ ВЫБОР
				|					КОГДА ИнвентаризацияЗапасов.Запасы.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|						ТОГДА ИнвентаризацияЗапасов.Запасы.Номенклатура.УпаковкаДляОтчета.Наименование
				|				КОНЕЦ
				|		КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
				|		Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
				|		Цена КАК Цена,
				|		ВЫБОР
				|			КОГДА ИнвентаризацияЗапасов.Запасы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|				ТОГДА ИнвентаризацияЗапасов.Запасы.Количество
				|			ИНАЧЕ ВЫБОР
				|					КОГДА ИнвентаризацияЗапасов.Запасы.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|						ТОГДА ИнвентаризацияЗапасов.Запасы.Количество / ИнвентаризацияЗапасов.Запасы.Номенклатура.УпаковкаДляОтчета.Коэффициент
				|				КОНЕЦ
				|		КОНЕЦ КАК ФактКоличество,
				|		КоличествоПоДаннымУчета КАК БухКоличество,
				|		Сумма КАК ФактСумма,
				|		СуммаУчет КАК БухСумма
				|	)
				|ИЗ
				|	Документ.ИнвентаризацияЗапасов КАК ИнвентаризацияЗапасов
				|ГДЕ
				|	ИнвентаризацияЗапасов.Ссылка = &ТекущийДокумент
				|
				|УПОРЯДОЧИТЬ ПО
				|	ИнвентаризацияЗапасов.Запасы.НомерСтроки";
				
				Шапка = Запрос.Выполнить().Выбрать();
				Шапка.Следующий();
				ВыборкаСтрокТовары = Шапка.Запасы.Выбрать();
				
				// Параметры печати.
				ТабличныйДокумент.ПолеСверху = 0;
				ТабличныйДокумент.ПолеСлева  = 0;
				ТабличныйДокумент.ПолеСнизу  = 0;
				ТабличныйДокумент.ПолеСправа = 0;
				ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
				
				ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияЗапасов_ИНВ19";
				
				// Получение областей макета.
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияЗапасов.ПФ_ИНВ19");
				
				ОбластьМакетаШапка            = Макет.ПолучитьОбласть("Шапка");
				ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы1");
				ОбластьМакетаСтрока           = Макет.ПолучитьОбласть("СтрокаТаблицы1");
				ОбластьМакетаИтогоПоСтранице  = Макет.ПолучитьОбласть("ИтогоТаблицы1");
				ОбластьМакетаПодвал           = Макет.ПолучитьОбласть("Подвал");
				
				// Вывод шапки документа.
				ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
				
				СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
				ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
				ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
				
				Если Шапка.ДатаДокумента < Дата('20110101') Тогда
					НомерДокумента = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
				Иначе
					НомерДокумента =ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс, Истина);
				КонецЕсли;		
				
				ОбластьМакетаШапка.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
				ОбластьМакетаШапка.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
				ОбластьМакетаШапка.Параметры.ДатаНачалаИнвентаризации = Шапка.ДатаНачалаИнвентаризации;
				ОбластьМакетаШапка.Параметры.НомерДокумента           = НомерДокумента;
				
				ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				НомерСтраницы   = 2;
				НомерСтроки     = 1;
				КоличествоСтрок = ВыборкаСтрокТовары.Количество();
				
				ИтогоРезультатИзлишекКоличество   = 0;
				ИтогоРезультатИзлишекСумма        = 0;
				ИтогоРезультатНедостачаКоличество = 0;
				ИтогоРезультатНедостачаСумма      = 0;
				
				// Вывод заголовка таблицы.
				ОбластьМакетаЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
				ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
				
				// Вывод многострочной части докмента.
				Пока ВыборкаСтрокТовары.Следующий() Цикл
					
					ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);																		
					ОбластьМакетаСтрока.Параметры.ТоварНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокТовары.ТоварНаименование, 
					ВыборкаСтрокТовары.Партия);
					
					Разница     = 0;
					РазницаСумм = 0;
					
					Разница     = ВыборкаСтрокТовары.ФактКоличество - ВыборкаСтрокТовары.БухКоличество;
					РазницаСумм = ВыборкаСтрокТовары.ФактСумма      - ВыборкаСтрокТовары.БухСумма;
					
					Если Разница = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ОбластьМакетаСтрока.Параметры.Номер = НомерСтроки;
					
					Если Разница < 0 Тогда
						
						ОбластьМакетаСтрока.Параметры.РезультатНедостачаКоличество = - Разница;
						ОбластьМакетаСтрока.Параметры.РезультатНедостачаСумма      = - РазницаСумм;
						ОбластьМакетаСтрока.Параметры.РезультатИзлишекКоличество   = 0;
						ОбластьМакетаСтрока.Параметры.РезультатИзлишекСумма        = 0;
						
						ИтогоРезультатНедостачаКоличество = ИтогоРезультатНедостачаКоличество + ( - Разница);
						ИтогоРезультатНедостачаСумма      = ИтогоРезультатНедостачаСумма      + ( - РазницаСумм);
						ИтогоРезультатИзлишекКоличество   = ИтогоРезультатИзлишекКоличество   + 0;
						ИтогоРезультатИзлишекСумма        = ИтогоРезультатИзлишекСумма        + 0;
						
					Иначе
						
						ОбластьМакетаСтрока.Параметры.РезультатНедостачаКоличество = 0;
						ОбластьМакетаСтрока.Параметры.РезультатНедостачаСумма      = 0;
						ОбластьМакетаСтрока.Параметры.РезультатИзлишекКоличество   = Разница;
						ОбластьМакетаСтрока.Параметры.РезультатИзлишекСумма        = РазницаСумм;
						
						ИтогоРезультатНедостачаКоличество = ИтогоРезультатНедостачаКоличество + 0;
						ИтогоРезультатНедостачаСумма      = ИтогоРезультатНедостачаСумма      + 0;
						ИтогоРезультатИзлишекКоличество   = ИтогоРезультатИзлишекКоличество   + Разница;
						ИтогоРезультатИзлишекСумма        = ИтогоРезультатИзлишекСумма        + РазницаСумм;
						
					КонецЕсли;
					
					// Проверка вывода.
					СтрокаСПодвалом = Новый Массив();
					СтрокаСПодвалом.Добавить(ОбластьМакетаСтрока);
					СтрокаСПодвалом.Добавить(ОбластьМакетаИтогоПоСтранице);
					СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
					
					Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
						
						Если НЕ КоличествоСтрок = 1 Тогда
							
							// Вывод итого по странице.
							ТабличныйДокумент.Вывести(ОбластьМакетаИтогоПоСтранице);
							
							// Вывод разделителя страниц.
							ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							
							// Вывод заголовка таблицы.
							НомерСтраницы = НомерСтраницы + 1;
							ОбластьМакетаЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
							ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
							
						КонецЕсли;
						
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
					
					НомерСтроки = НомерСтроки + 1;
					
				КонецЦикла;
				
				// Вывод итого по странице.
				ОбластьМакетаИтогоПоСтранице.Параметры.ИтогоРезультатИзлишекКоличество   = ИтогоРезультатИзлишекКоличество;
				ОбластьМакетаИтогоПоСтранице.Параметры.ИтогоРезультатИзлишекСумма        = ИтогоРезультатИзлишекСумма;
				ОбластьМакетаИтогоПоСтранице.Параметры.ИтогоРезультатНедостачаКоличество = ИтогоРезультатНедостачаКоличество;
				ОбластьМакетаИтогоПоСтранице.Параметры.ИтогоРезультатНедостачаСумма      = ИтогоРезультатНедостачаСумма;
				ТабличныйДокумент.Вывести(ОбластьМакетаИтогоПоСтранице);
				
				// Вывод подвала.
				// ОбластьМакетаПодвал.Параметры.Заполнить(Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
				
			КонецЕсли;
			
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
			
		КонецЦикла;
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов,ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыВывода) Экспорт
		
		ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИнвентаризацияЗапасов") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИнвентаризацияЗапасов", "Инвентаризация запасов", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ИнвентаризацияЗапасов"));
			
		ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_ИНВ3") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_ИНВ3", "ИНВ3", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПФ_ИНВ3"));
			
		ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ3БезФактическихДанных") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ3БезФактическихДанных", "ИНВ-3 (Инвентаризационная опись с пустыми фактическими данными)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ИНВ3БезФактическихДанных"));
			
		ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_ИНВ19") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_ИНВ19", "ИНВ19", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПФ_ИНВ19"));
			
		КонецЕсли;
		
	КонецПроцедуры
	
	// Функция получения списка печатных форм.
	//
	Функция ПолучитьСписокПечатныхФорм() Экспорт
		
		Список = Новый СписокЗначений;
		Список.Добавить("ИнвентаризацияЗапасов", "Инвентаризация запасов", , БиблиотекаКартинок.Документ);
		Список.Добавить("ПФ_ИНВ19", "ИНВ-19 (Сличительная ведомость)", , БиблиотекаКартинок.Документ);
		Список.Добавить("ПФ_ИНВ3", "ИНВ-3 (Инвентаризационная опись товаров)", , БиблиотекаКартинок.Документ);
		Список.Добавить("ИНВ3БезФактическихДанных", "ИНВ-3 (Инвентаризационная опись с пустыми фактическими данными)", , БиблиотекаКартинок.Документ);
		
		
		Возврат Список;
		
	КонецФункции
	
	#Область ЗагрузкаДанныхИзВнешнегоИсточника
	
	Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
		
		//
		// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
		//
		
		ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
		
		ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
		ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
		ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
		ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
		ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
		ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
		ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
		ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
		ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
		
		ЭтоЗапасы = (ПолноеИмяОбъектаЗаполнения = "Документ.ИнвентаризацияЗапасов.ТабличнаяЧасть.Запасы");
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", "Группа", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, , , , );
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Код", "Код", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", "Штрихкод", ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", "Артикул", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование","Номенклатура (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 4, , Истина);
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное","Номенклатура (полное наименование)", ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодНоменклатурыМедицинскиУслуг", "Код услуги", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 6,,Истина);
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", "Партия (наименование)", ОписаниеТиповСтрока150, ОписаниеТиповКолонка);	
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", "Количество", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);	
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", "Цена", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , ,);	
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПоУмолчанию", "Упаковка поступления", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
		// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПродажи", "Упаковка продажи", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Коэффициент", "Коэффициент упаковки", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2);
		
	КонецПроцедуры
	
	Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
		
		Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
		ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
		НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
		
	КонецПроцедуры
	
	Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
		
		НастройкиОбновленияСвойств  = ПараметрыСопоставления.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
		ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
		РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
		НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
		ПолноеИмяОбъектаЗаполнения 	= НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
		
		// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
		Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
			
			// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное, Код, КодУслугиМЗ
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, 
			СтрокаТаблицыФормы.Штрихкод, 
			СтрокаТаблицыФормы.Артикул, 
			СтрокаТаблицыФормы.НоменклатураНаименование, 
			СтрокаТаблицыФормы.НоменклатураНаименованиеПолное, 
			СтрокаТаблицыФормы.Код,
			СтрокаТаблицыФормы.КодНоменклатурыМедицинскиУслуг);
			ЭтаСтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
			
			// Родитель по наименованию
			ЗначениеПоУмолчанию = Справочники.Номенклатура.ПустаяСсылка();
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Номенклатура", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель)
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель_ВходящиеДанные) Тогда
				
				ГруппаНоменклатуры = Справочники.Номенклатура.СоздатьГруппу();
				ГруппаНоменклатуры.Наименование = СтрокаТаблицыФормы.Родитель_ВходящиеДанные;
				ГруппаНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
				ГруппаНоменклатуры.Записать();
				СтрокаТаблицыФормы.Родитель = ГруппаНоменклатуры.Ссылка;
				
			КонецЕсли;
			
			// Упаковк по умолчанию
			ЗначениеПоУмолчанию = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьУпаковку(СтрокаТаблицыФормы.УпаковкаПоУмолчанию, СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные, СтрокаТаблицыФормы.Номенклатура, ЗначениеПоУмолчанию);
			
			// Коэффициент
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Коэффициент, СтрокаТаблицыФормы.Коэффициент_ВходящиеДанные, 1);
			
			Если НЕ ЭтаСтрокаСопоставлена
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураНаименование) Тогда
				
				ЭлементСправочника = Справочники.Номенклатура.СоздатьЭлемент();	
				ЭлементСправочника.Заполнить(Новый Структура("Родитель", СтрокаТаблицыФормы.Родитель));
				ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицыФормы, , ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СтандартныеИменаПолейНеподлежащихОбновлению(ПараметрыСопоставления.НастройкиЗагрузкиДанных));
				ЭлементСправочника.Записать();
				СтрокаТаблицыФормы.Номенклатура = ЭлементСправочника.Ссылка;
				
				ЭлементСправочника.Наименование = СтрокаТаблицыФормы.НоменклатураНаименование;
				ЭлементСправочника.НаименованиеПолное = ?(ПустаяСтрока(СтрокаТаблицыФормы.НоменклатураНаименованиеПолное), СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
				ЭлементСправочника.ЭтоУслуга = ?(ЭлементСправочника.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга, Истина, Ложь);
				ЭлементСправочника.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию)
					И ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные) Тогда
					
					// Создать упаковку по умолчанию
					НоваяУпаковка = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
					НоваяУпаковка.Владелец     = ЭлементСправочника.Ссылка;
					НоваяУпаковка.Наименование = СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные;
					НоваяУпаковка.Коэффициент  = СтрокаТаблицыФормы.Коэффициент;
					НоваяУпаковка.Записать();
					
					ЭлементСправочника.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
					СтрокаТаблицыФормы.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
					
				КонецЕсли;
				
				ЭлементСправочника.Записать();
				
			КонецЕсли;
			
			// Если ПолноеИмяОбъектаЗаполнения = "Документ.ВозвратПоставщику.ТабличнаяЧасть.Запасы" Тогда
			//	
			Если СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда			
				СтрокаТаблицыФормы.Номенклатура = Неопределено;			
			КонецЕсли;
			
			//// Партия по Владельцу и Наименованию
			// ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
			
			// ХарактеристикаСсылка = Справочники.ПартииНоменклатуры.ПустаяСсылка();
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				СсылкаНомеклатуры = СтрокаТаблицыФормы.Номенклатура.Ссылка;
				Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Партия_ВходящиеДанные) Тогда
					
					НомеклатураОбъект = СсылкаНомеклатуры.ПолучитьОбъект();
					Если НомеклатураОбъект.ИспользоватьПартии = Ложь Тогда
						НомеклатураОбъект.ИспользоватьПартии = Истина;
						НомеклатураОбъект.Записать();
					КонецЕсли;
					
					НоваяХарактеристика = Справочники.ПартииНоменклатуры.Выбрать(, СсылкаНомеклатуры, Новый Структура("Наименование", СтрокаТаблицыФормы.Партия_ВходящиеДанные));
					Если НоваяХарактеристика.Следующий() Тогда
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					Иначе
						НоваяХарактеристика              = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
						НоваяХарактеристика.Владелец     = СсылкаНомеклатуры;
						НоваяХарактеристика.Наименование = СтрокаТаблицыФормы.Партия_ВходящиеДанные;
						НоваяХарактеристика.Записать();
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			// КонецЕсли;
			
			// Количество
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
			
			// Цена
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 0);
			
			ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения);
			
			ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
			
		КонецЦикла;
		
		ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
		
	КонецПроцедуры
	
	Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
		
		ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
		
		Если ПолноеИмяОбъектаЗаполнения = "Документ.ИнвентаризацияЗапасов.ТабличнаяЧасть.Запасы" Тогда
			
			СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
			И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
			И СтрокаТаблицыФормы.Количество <> 0;
			
		КонецЕсли;
		
	КонецПроцедуры
	
	#КонецОбласти  
	
	#КонецОбласти
	
#КонецЕсли
